---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartWidthInOption
source: html/378d8785-0da5-f772-c43d-5fef70e878a3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartWidthInOption Property

"Main Primary Width Option"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartWidthInOption { get; }
```